const errors = {
    100: "一般请求错误",
    101: "邮箱格式错误",
    110: "用户名过长",
    111: "密码过短",
    112: "密码过长",

    301: "权限不足",
    302: "需要登录",
    303: "认证令牌无效或过期。请尝试重新登录",
    304: "该账户已被禁用。请联系您组织的 Offgrid 管理员",
    310: "邮箱未确认",
    311: "您的注册请求正等待审核，请勿重复注册",
    312: "您的注册请求已被拒绝",
    313: "该邮箱已注册",
    314: "令牌过期。请重新获取令牌。注意该令牌与登录无关",
    320: "安全策略禁止创建具有比您更多权限的用户",
    321: "安全策略禁止删除具有比您更多权限的用户",
    322: "不能通过用户管理页面删除当前账户。要想删除当前账户，请通过页面右上角的下拉菜单访问您的“个人信息”页面",

    400: "指定的实体不存在",
    401: "邮箱或密码不正确",
    402: "非法令牌。请重新获取令牌。注意该令牌与登录无关",

    510: "邮件发送失败"
};

export default errors;
